benchmarks/results_after_tuning.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/peak_fixed.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m15s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 45s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 020/200 VUs, 18289 complete and 0 interrupted iterations
default   [   2% ] 020/200 VUs  01.0s/45.0s

running (0m02.0s), 040/200 VUs, 43681 complete and 0 interrupted iterations
default   [   4% ] 040/200 VUs  02.0s/45.0s

running (0m03.0s), 060/200 VUs, 69396 complete and 0 interrupted iterations
default   [   7% ] 060/200 VUs  03.0s/45.0s

running (0m04.0s), 080/200 VUs, 97711 complete and 0 interrupted iterations
default   [   9% ] 080/200 VUs  04.0s/45.0s

running (0m05.0s), 100/200 VUs, 124503 complete and 0 interrupted iterations
default   [  11% ] 100/200 VUs  05.0s/45.0s

running (0m06.0s), 119/200 VUs, 140318 complete and 0 interrupted iterations
default   [  13% ] 119/200 VUs  06.0s/45.0s

running (0m07.0s), 139/200 VUs, 153472 complete and 0 interrupted iterations
default   [  16% ] 139/200 VUs  07.0s/45.0s

running (0m08.0s), 160/200 VUs, 168297 complete and 0 interrupted iterations
default   [  18% ] 160/200 VUs  08.0s/45.0s

running (0m09.0s), 179/200 VUs, 183240 complete and 0 interrupted iterations
default   [  20% ] 179/200 VUs  09.0s/45.0s

running (0m10.0s), 199/200 VUs, 202046 complete and 0 interrupted iterations
default   [  22% ] 199/200 VUs  10.0s/45.0s

running (0m11.0s), 200/200 VUs, 219366 complete and 0 interrupted iterations
default   [  24% ] 200/200 VUs  11.0s/45.0s

running (0m12.0s), 200/200 VUs, 239915 complete and 0 interrupted iterations
default   [  27% ] 200/200 VUs  12.0s/45.0s

running (0m13.0s), 200/200 VUs, 258184 complete and 0 interrupted iterations
default   [  29% ] 200/200 VUs  13.0s/45.0s

running (0m14.0s), 200/200 VUs, 278803 complete and 0 interrupted iterations
default   [  31% ] 200/200 VUs  14.0s/45.0s

running (0m15.0s), 200/200 VUs, 300067 complete and 0 interrupted iterations
default   [  33% ] 200/200 VUs  15.0s/45.0s

running (0m16.0s), 200/200 VUs, 320007 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  16.0s/45.0s

running (0m17.0s), 200/200 VUs, 339500 complete and 0 interrupted iterations
default   [  38% ] 200/200 VUs  17.0s/45.0s

running (0m18.0s), 200/200 VUs, 361235 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  18.0s/45.0s

running (0m19.0s), 200/200 VUs, 378942 complete and 0 interrupted iterations
default   [  42% ] 200/200 VUs  19.0s/45.0s

running (0m20.0s), 200/200 VUs, 400021 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  20.0s/45.0s

running (0m21.0s), 200/200 VUs, 420730 complete and 0 interrupted iterations
default   [  47% ] 200/200 VUs  21.0s/45.0s

running (0m22.0s), 200/200 VUs, 436874 complete and 0 interrupted iterations
default   [  49% ] 200/200 VUs  22.0s/45.0s

running (0m23.0s), 200/200 VUs, 456417 complete and 0 interrupted iterations
default   [  51% ] 200/200 VUs  23.0s/45.0s

running (0m24.0s), 200/200 VUs, 475662 complete and 0 interrupted iterations
default   [  53% ] 200/200 VUs  24.0s/45.0s

running (0m25.0s), 200/200 VUs, 494499 complete and 0 interrupted iterations
default   [  56% ] 200/200 VUs  25.0s/45.0s

running (0m26.0s), 200/200 VUs, 512032 complete and 0 interrupted iterations
default   [  58% ] 200/200 VUs  26.0s/45.0s

running (0m27.0s), 200/200 VUs, 526578 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  27.0s/45.0s

running (0m28.0s), 200/200 VUs, 543968 complete and 0 interrupted iterations
default   [  62% ] 200/200 VUs  28.1s/45.0s

running (0m29.0s), 200/200 VUs, 559440 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  29.0s/45.0s

running (0m30.0s), 200/200 VUs, 576061 complete and 0 interrupted iterations
default   [  67% ] 200/200 VUs  30.0s/45.0s

running (0m31.0s), 200/200 VUs, 592955 complete and 0 interrupted iterations
default   [  69% ] 200/200 VUs  31.0s/45.0s

running (0m32.0s), 200/200 VUs, 611714 complete and 0 interrupted iterations
default   [  71% ] 200/200 VUs  32.0s/45.0s

running (0m33.0s), 200/200 VUs, 629862 complete and 0 interrupted iterations
default   [  73% ] 200/200 VUs  33.0s/45.0s

running (0m34.0s), 200/200 VUs, 648664 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  34.0s/45.0s

running (0m35.0s), 200/200 VUs, 667526 complete and 0 interrupted iterations
default   [  78% ] 200/200 VUs  35.0s/45.0s

running (0m36.0s), 200/200 VUs, 685777 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  36.0s/45.0s

running (0m37.0s), 200/200 VUs, 705025 complete and 0 interrupted iterations
default   [  82% ] 200/200 VUs  37.0s/45.0s

running (0m38.0s), 200/200 VUs, 721754 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  38.0s/45.0s

running (0m39.0s), 200/200 VUs, 741266 complete and 0 interrupted iterations
default   [  87% ] 200/200 VUs  39.0s/45.0s

running (0m40.0s), 200/200 VUs, 758718 complete and 0 interrupted iterations
default   [  89% ] 200/200 VUs  40.0s/45.0s

running (0m41.0s), 162/200 VUs, 776870 complete and 0 interrupted iterations
default   [  91% ] 162/200 VUs  41.0s/45.0s

running (0m42.0s), 121/200 VUs, 794738 complete and 0 interrupted iterations
default   [  93% ] 121/200 VUs  42.0s/45.0s

running (0m43.0s), 082/200 VUs, 813576 complete and 0 interrupted iterations
default   [  96% ] 082/200 VUs  43.0s/45.0s

running (0m44.0s), 041/200 VUs, 831609 complete and 0 interrupted iterations
default   [  98% ] 041/200 VUs  44.0s/45.0s

running (0m45.0s), 001/200 VUs, 844559 complete and 0 interrupted iterations
default   [ 100% ] 001/200 VUs  45.0s/45.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<50' p(95)=15.93ms

    http_req_failed{expected_response:true}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 844619  18769.203918/s
    checks_succeeded...: 100.00% 844619 out of 844619
    checks_failed......: 0.00%   0 out of 844619

    ✓ status is 200 or 429

    HTTP
    http_req_duration..............: avg=8.42ms min=114µs    med=8.14ms max=181.59ms p(90)=13.55ms p(95)=15.93ms
      { expected_response:true }...: avg=8.42ms min=114µs    med=8.14ms max=181.59ms p(90)=13.55ms p(95)=15.93ms
    http_req_failed................: 0.00%  0 out of 844619
      { expected_response:true }...: 0.00%  0 out of 844619
    http_reqs......................: 844619 18769.203918/s

    EXECUTION
    iteration_duration.............: avg=8.83ms min=124.79µs med=8.36ms max=181.73ms p(90)=14ms    p(95)=16.96ms
    iterations.....................: 844619 18769.203918/s
    vus............................: 1      min=1           max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 276 MB 6.1 MB/s
    data_sent......................: 168 MB 3.7 MB/s



running (0m45.0s), 000/200 VUs, 844619 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  45s